DataFrame

In [1]:
import pandas as pd

data = {
        'Name': ['Mg Mg', 'Aung Aung', 'Ma Ma', 'Hla Hla', 'Kyaw Kyaw'], 
        'Age': [25, 30, 22, 35, 28], 
        'Gender': ['Male', 'Male', 'Female', 'Female', 'Male'], 
        'Salary': [50000, 55000, 40000, 70000, 48000]
        }

df = pd.DataFrame(data)
print(df[['Name','Age', 'Salary', 'Gender']]) #col select

        Name  Age  Salary  Gender
0      Mg Mg   25   50000    Male
1  Aung Aung   30   55000    Male
2      Ma Ma   22   40000  Female
3    Hla Hla   35   70000  Female
4  Kyaw Kyaw   28   48000    Male

In [2]:
print(df[['Name','Age', 'Salary', 'Gender']]) #col select

        Name  Age  Salary  Gender
0      Mg Mg   25   50000    Male
1  Aung Aung   30   55000    Male
2      Ma Ma   22   40000  Female
3    Hla Hla   35   70000  Female
4  Kyaw Kyaw   28   48000    Male

In [3]:
print(df.iloc[1])  #row select

Name      Aung Aung
Age              30
Gender         Male
Salary        55000
Name: 1, dtype: object

In [4]:
print(df.iloc[1:5])

        Name  Age  Gender  Salary
1  Aung Aung   30    Male   55000
2      Ma Ma   22  Female   40000
3    Hla Hla   35  Female   70000
4  Kyaw Kyaw   28    Male   48000